examples/flow_past_cylinder/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.3.0                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
	(-32 -64  0.5 )
	(-32 -6   0.5 )
	(-32  6   0.5 )
	(-32  64  0.5 )
	( -6 -64  0.5 )
	( -6 -6   0.5 )
	( -6  6   0.5 )
	( -6  64  0.5 )
	(  6 -64  0.5 )
	(  6 -6   0.5 )
	(  6  6   0.5 )
	(  6  64  0.5 )
	( 96 -64  0.5 )
	( 96 -6   0.5 )
	( 96  6   0.5 )
	( 96  64  0.5 )
	(-32 -64 -0.5 )
	(-32 -6  -0.5 )
	(-32  6  -0.5 )
	(-32  64 -0.5 )
	( -6 -64 -0.5 )
	( -6 -6  -0.5 )
	( -6  6  -0.5 )
	( -6  64 -0.5 )
	(  6 -64 -0.5 )
	(  6 -6  -0.5 )
	(  6  6  -0.5 )
	(  6  64 -0.5 )
	( 96 -64 -0.5 )
	( 96 -6  -0.5 )
	( 96  6  -0.5 )
	( 96  64 -0.5 )
);
blocks
(
/* hex ( 16 20 21 17 0 4 5 1 )   (30 25 1) simpleGrading (0.033 0.05 1) */
/* hex ( 17 21 22 18 1 5 6 2 )   (30 60 1) simpleGrading (0.033 1    1) */
/* hex ( 18 22 23 19 2 6 7 3 )   (30 25 1) simpleGrading (0.033 20.0 1) */
/* hex ( 20 24 25 21 4 8 9 5 )   (60 25 1) simpleGrading (1    0.05 1) */
/* hex ( 21 25 26 22 5 9 10 6 )  (60 60 1) simpleGrading (1    1    1) */
/* hex ( 22 26 27 23 6 10 11 7 ) (60 25 1) simpleGrading (1    20.0 1) */
/* hex ( 24 28 29 25 8 12 13 9 ) (40 25 1) simpleGrading (30.  0.05 1) */
/* hex ( 25 29 30 26 9 13 14 10 )(40 60 1) simpleGrading (30.  1    1) */
/* hex ( 26 30 31 27 10 14 15 11)(40 25 1) simpleGrading (30.  20.0 1) */

hex ( 16 20 21 17 0 4 5 1 )   ( 40  80 1) simpleGrading (0.05 0.05 1)
hex ( 17 21 22 18 1 5 6 2 )   ( 40 120 1) simpleGrading (0.05 1    1)
hex ( 18 22 23 19 2 6 7 3 )   ( 40  80 1) simpleGrading (0.05 20.0 1)
hex ( 20 24 25 21 4 8 9 5 )   (120  80 1) simpleGrading (1    0.05 1)
hex ( 21 25 26 22 5 9 10 6 )  (120 120 1) simpleGrading (1    1    1)
hex ( 22 26 27 23 6 10 11 7 ) (120  80 1) simpleGrading (1    20.0 1)
hex ( 24 28 29 25 8 12 13 9 ) (120  80 1) simpleGrading (20.  0.05 1)
hex ( 25 29 30 26 9 13 14 10 )(120 120 1) simpleGrading (20.  1    1)
hex ( 26 30 31 27 10 14 15 11)(120  80 1) simpleGrading (20.  20.0 1)
);
edges();

boundary
(
front
{
	type empty;
	faces (
		( 0 4 5 1 )
		( 1 5 6 2 )
		( 2 6 7 3 )
		( 4 8 9 5 )
		( 5 9 10 6 )
		( 6 10 11 7 )
		( 8 12 13 9 )
		( 9 13 14 10 )
		( 10 14 15 11 )
	);
}
back
{
	type empty;
	faces (
		( 16 20 21 17 )
		( 17 21 22 18 )
		( 18 22 23 19 )
		( 20 24 25 21 )
		( 21 25 26 22 )
		( 22 26 27 23 )
		( 24 28 29 25 )
		( 25 29 30 26 )
		( 26 30 31 27 )
	);
}
side1
{
	/* type cyclic; */
    /* neighbourPatch side2; */
    type wall;
	faces (
		( 16 20 4 0 )
		( 20 24 8 4 )
		( 24 28 12 8 )
	);
}
side2
{
	/* type cyclic; */
    /* neighbourPatch side1; */
    type wall;
	faces (
		( 19 23 7 3 )
		( 23 27 11 7 )
		( 27 31 15 11 )
	);
}
outlet
{
	type wall;
	faces (
		( 28 29 13 12 )
		( 29 30 14 13 )
		( 30 31 15 14 )
	);
}
inlet
{
	type wall;
	faces (
		( 16 17 1 0 )
		( 17 18 2 1 )
		( 18 19 3 2 )
	);
}
);
mergePatchPairs
(
);

