examples/flow_past_cylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          78400;
        startFace       156240;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          78400;
        startFace       234640;
    }
    side1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          280;
        startFace       313040;
    }
    side2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          280;
        startFace       313320;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          280;
        startFace       313600;
    }
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          280;
        startFace       313880;
    }
)

// ************************************************************************* //
